## Create and Access SQLLite Database using Python

### Create a database using SQLLite

In [7]:
import sqlite3

In [2]:
connection = sqlite3.connect('data.db')

In [3]:
# cursor object is used to interact with the database
cursor = connection.cursor()

### Create Table

In [4]:
table_create = "CREATE TABLE IF NOT EXISTS students (id INTEGER PRIMARY KEY, name TEXT, age INTEGER, department TEXT, address TEXT)"

cursor.execute(table_create)

### Insert Values into table

In [5]:
cursor.execute("INSERT INTO students VALUES (1, 'John', 22, 'Computer Science', '123 Main St.')")
cursor.execute("INSERT INTO students VALUES (2, 'Jane', 21, 'Mathematics', '456 Elm St.')")
cursor.execute("INSERT INTO students VALUES (3, 'Joe', 23, 'Physics', '789 Oak St.')")
cursor.execute("INSERT INTO students VALUES (4, 'Jill', 24, 'Chemistry', '101 Pine St.')")
cursor.execute("INSERT INTO students VALUES (5, 'Jack', 25, 'Biology', '202 Maple St.')")

In [15]:
statement = "SELECT * FROM students"
cursor.execute(statement)

# fetchall() method returns a list of tuples
# each tuple represents a row in the table
rows = cursor.fetchall()

rows

[(1, 'John', 26, 'Computer Science', '123 Main St.'),
 (2, 'Jane', 21, 'Mathematics', '456 Elm St.'),
 (3, 'Joe', 23, 'Physics', '789 Oak St.'),
 (4, 'Jill', 24, 'Chemistry', '101 Pine St.'),
 (5, 'Jack', 25, 'Biology', '202 Maple St.')]

In [14]:
##

update_statement = "UPDATE students SET age = 26 WHERE name = 'John'"

cursor.execute(update_statement)

statement = "SELECT * FROM students"
cursor.execute(statement)

rows = cursor.fetchall()
rows

[(1, 'John', 26, 'Computer Science', '123 Main St.'),
 (2, 'Jane', 21, 'Mathematics', '456 Elm St.'),
 (3, 'Joe', 23, 'Physics', '789 Oak St.'),
 (4, 'Jill', 24, 'Chemistry', '101 Pine St.'),
 (5, 'Jack', 25, 'Biology', '202 Maple St.')]

### Pandas and Database

In [19]:
import pandas as pd

statement = "SELECT * FROM students where age > 22"
df = pd.read_sql_query(statement, connection)

df

   id  name  age        department        address
0   1  John   26  Computer Science   123 Main St.
1   3   Joe   23           Physics    789 Oak St.
2   4  Jill   24         Chemistry   101 Pine St.
3   5  Jack   25           Biology  202 Maple St.

### Close Connection

In [22]:
cursor.close()
connection.close()